0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{


    inlet
    {
        type            freestream;
        freestreamValue           $internalField;
    }



    outlet
    {
         type            zeroGradient;
    }


    frontAndBack
    {
        type            freestream;
        freestreamValue           $internalField;
    }


    topAndBottom
    {
        type            freestream;
        freestreamValue           $internalField;
    }

    bowl
    {
         type            zeroGradient;
    }


    nozzle
    {
	type	totalTemperature;
	T0	uniform 1000;
	U U; 
	//phi phi; 
	//rho none; 
	//psi none
	value 	uniform 1727.279;
	gamma		1.4;
    }


}

// ************************************************************************* //
