0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (400 0 0);

boundaryField
{

    inlet
    {
        type            freestream;
        freestreamValue           $internalField;
    }

    outlet
    {
	type            zeroGradient;
    }

    frontAndBack
    {
        type            freestream;
        freestreamValue           $internalField;
    }

    topAndBottom
    {
        type            freestream;
        freestreamValue           $internalField;
    }

    bowl
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    nozzle
    {
	type pressureDirectedInletVelocity ;
	inletDirection uniform (1 0 0);
	//U U; 
	//phi phi; 
	// none; 
	//psi none;
	value uniform (990.8560 0 0); 
    }



}

// ************************************************************************* //
