0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{




    inlet3
    {
        type            calculated;
        value           uniform 0;
    }



    outlet
    {
         type            zeroGradient;
    }

    atmosphere
    {
         type            freestream;
	freestreamValue 0;
    }

    bb 
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
      nozzle
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }

      inlet
    {
         type            freestream;
	freestreamValue 0;
    }



}


// ************************************************************************* //
