0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.1;

boundaryField
{




    inlet3
    {
            type            fixedValue;
        value            $internalField;
    }



    outlet
    {
         type            zeroGradient;
    }

    atmosphere
    {
        type            freestream;
     //   inletValue      $internalField;
        freestreamValue           $internalField;
    }

    bb 
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
      nozzle
    {
        type            epsilonWallFunction;
        value           $internalField;
    }

      inlet
    {
        type            freestream;
     //   inletValue      $internalField;
        freestreamValue           $internalField;
    }



}


// ************************************************************************* //
