0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    inlet
    {
        type            freestream;
        freestreamValue           $internalField;
    }

    outlet
    {
	type            zeroGradient;
    }

    frontAndBack
    {
        type            freestream;
        freestreamValue           $internalField;
    }

    topAndBottom
    {
        type            freestream;
        freestreamValue           $internalField;
    }

    bowl
    {
	type            zeroGradient;
    }


    nozzle
    {
        type totalPressure;
	p0 uniform 5167575;// <- Is that the total pressure?
	U U; 
	//phi phi; 
	//rho none; 
	//psi none
	value uniform 2917001.77;
	gamma 1.4; 
    }

}

// ************************************************************************* //
